app/controllers/main_controller.rb

def posting
    @msg=params['msg']
    @uid=params['user_id']
    Post.create(msg:@msg,user_id:@uid)
---
INSERT INTO "posts" ("msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msg", "hihihihi"], ["user_id", 1], ["created_at", "2021-09-09 10:18:09.158798"], ["updated_at", "2021-09-09 10:18:09.158798"]]

def reading
    @uid2 = params["user_id"]
    @x=User.find(@uid2).posts
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]